In [3]:
import numpy as np

from pandas import Series,DataFrame
import pandas as pd

In [5]:
dframe = DataFrame({'key':['X','Z','Y','Z','X','X'],'dataset1':np.arange(6)})

In [6]:
dframe

   dataset1 key
0         0   X
1         1   Z
2         2   Y
3         3   Z
4         4   X
5         5   X

In [7]:
dframe2 = DataFrame({'key':['Q','Y','Z'],'dataset2':np.arange(3)})

In [8]:
dframe2

   dataset2 key
0         0   Q
1         1   Y
2         2   Z

In [9]:
pd.merge(dframe,dframe2)

   dataset1 key  dataset2
0         1   Z         2
1         3   Z         2
2         2   Y         1

In [10]:
pd.merge(dframe,dframe2,on='key')

   dataset1 key  dataset2
0         1   Z         2
1         3   Z         2
2         2   Y         1

In [12]:
# We can choose which DataFrame's keys to use, this will choose left (dframe1)
pd.merge(dframe,dframe2,on='key',how='left')

   dataset1 key  dataset2
0         0   X       NaN
1         1   Z       2.0
2         2   Y       1.0
3         3   Z       2.0
4         4   X       NaN
5         5   X       NaN

In [13]:
pd.merge(dframe,dframe2,on='key',how='right')

   dataset1 key  dataset2
0       1.0   Z         2
1       3.0   Z         2
2       2.0   Y         1
3       NaN   Q         0

In [14]:
pd.merge(dframe,dframe2,on='key',how='outer') #chooses union of both keys

   dataset1 key  dataset2
0       0.0   X       NaN
1       4.0   X       NaN
2       5.0   X       NaN
3       1.0   Z       2.0
4       3.0   Z       2.0
5       2.0   Y       1.0
6       NaN   Q       0.0

In [15]:
dframe3 = DataFrame({'key':['X','X','X','Y','Y','Z'],'dataset3':np.arange(6)})

dframe4 = DataFrame({'key':['Y','Y','X','X','Z'],'dataset4':np.arange(5)})

pd.merge(dframe3,dframe4)

    dataset3 key  dataset4
0          0   X         2
1          0   X         3
2          1   X         2
3          1   X         3
4          2   X         2
5          2   X         3
6          3   Y         0
7          3   Y         1
8          4   Y         0
9          4   Y         1
10         5   Z         4

A many to many merge results in the product of the rows. Because there were 3 'X's in dframe3 and 2 'X's in dframe4 there ended up being a total of 6 'X' rows in the result (2*3=6)! Note how dframe3 repeats its 0,1,2 values for 'X' and dframe4 repeats its '2,3' pairs throughout the key set.

In [16]:
# We can also merge with multiple keys!

# Dframe on left
df_left = DataFrame({'key1': ['SF', 'SF', 'LA'],
                  'key2': ['one', 'two', 'one'],
                  'left_data': [10,20,30]})

#Dframe on right
df_right = DataFrame({'key1': ['SF', 'SF', 'LA', 'LA'],
                   'key2': ['one', 'one', 'one', 'two'],
                   'right_data': [40,50,60,70]})

#Merge
pd.merge(df_left, df_right, on=['key1', 'key2'], how='outer')

  key1 key2  left_data  right_data
0   SF  one       10.0        40.0
1   SF  one       10.0        50.0
2   SF  two       20.0         NaN
3   LA  one       30.0        60.0
4   LA  two        NaN        70.0

In [17]:
#Note that the left and right DataFrames have overlapping key names (key1 and key2).
# pandas automatically adds suffixes to them

pd.merge(df_left,df_right,on='key1')

  key1 key2_x  left_data key2_y  right_data
0   SF    one         10    one          40
1   SF    one         10    one          50
2   SF    two         20    one          40
3   SF    two         20    one          50
4   LA    one         30    one          60
5   LA    one         30    two          70

In [18]:
pd.merge(df_left,df_right, on='key1', suffixes=('_lefty','_righty'))

  key1 key2_lefty  left_data key2_righty  right_data
0   SF        one         10         one          40
1   SF        one         10         one          50
2   SF        two         20         one          40
3   SF        two         20         one          50
4   LA        one         30         one          60
5   LA        one         30         two          70